// 4) შექმენით ფუნქცია რომელსად პარამეტრად გადაეცემა შემდეგი ცვლადები num1 , num2 , num3

// შენი დავალებააფუნქციამ კონსოლში გამოიტანოს ამ სამი რიცხვის ნამრავლი

// გამოიძახე ფუნქცია ოთხჯერ ოღონდ განსხვავებული არგუმენტებით

function number(num1 , num2 , num3){
    console.log(num1*num2*num3)
}

number(11 , 12,13)
number(876 , 890, 678)
number(456 , 678 , 543)
number(345 , 6543 , 1234)

// 5)შექმენი ფუნქცია და გადაეცი ერთი არგუმენტი --> name

// ფუნქციამ უნდა დააკონსოლლოგოს ამ სახელის სიგრძე

// გამოძახე ფუნქცია 3 ჯერ სხვადასხვა სახელებით

function nam(name1){
    console.log(name1.length)
}

nam('demetre')
nam('goga')
nam('dato')