// მომხმარებელს შემოაყვანინეთ რაიმე სტრინგი

// შემდეგ შეამოწმეთ --> თუ ეს სტრინგი იწყება ასო "g" ზე --> და <-- ამ სტრინგის სიგრძე არის 6 ზე მეტიანტოლი დააკონსოლლოგე --> "იწყება გ ასოზე და არის გრძელი სიტყვა" 

// თუ ეს სტრინგი იწყება ასო "a" ზე და მისი გირძე ნაკლებია 6 ზე დააკონსოლლოგე ---> "იწყება ა ასოზე და არის მოკლე სიტყვა"

// სხვა შემთხვევაშ დაუკონსოლლოგე --> "ამოუცნობი სიტგვა"


let str = prompt("შემოიტანე სტრინგი:")

if(str.startsWith("g") && str.length >= 6){
    console.log("იწყება გ ასოზე და არის გრძელი სიტყვა" )
}else if(str.startsWith("a") && str.length < 6){
    console.log("იწყება ა ასოზე და არის მოკლე სიტყვა" )
}else{
    console.log("ამოუცნობი სიტგვა")
}