# 1) კომენტარის სახით ახსენით რას აკეთებს Count() ფუნქცია.
# 
# 2) კომენტარის სახით ახსენით როგორ მუშაობს sorted()  ფუნქცია და ძირითადად რომელ მონაცემთა ტიპებზე ვიყენებთ მას.
# 
# # 3) შექმენით სია სადაც შეინახავთ ინგლისური ანბანის ყველა ასოს არეულად. გამოიყენეთ sorted() ფუნქცია, რატა დაალაგოთ ისინი და შედეგები გამოიტანეთ ეკრანზე.
# 
# # 4) სიაში შინახეთ მინიმუმ 15 რიცხვი დაულაგებელი წყობით. გამოიყენეთ sorted() ფუნქცია რომ დაალაგოთ ისინი ზრდადობის მიხედვით, ბოლოს კი დალაგებული რიცხვების თანმიმდევრობა დაბეჭდეთ ტერმინალში.
# 
# # 5) შექმენით სია და მასში არეულად დაამატეთ 10 რიცხვი. გამოიყენეთ sorted() ფუნქცია და ინდექსინგი რათა დაალაგოთ სიაში მოცემული რიცხვები კლებადობის მიხედვით.

# ---------------------------------------------------------------------------------------------------------------------------------------------------

# 1
# ქაუნთ ფუნქცია ზრდადობის მიხედვით ალაგებს რიცხვებს

# 2
# სორტედ ფუნქცია სახელებს ალაგებს ანბანის მიხედვით და მას ძირითადად str() ფუნქციებზე იყენებენ

# 3

list_alpa = ['g', 'w', 'q', 'l', 'n', 't', 'j', 'f', 'm', 'd', 'r', 'a', 'b', 'v', 'x', 'z', 'o', 'k', 'y', 'c', 's', 'p', 'e', 'h', 'i', 'u']

print(list_alpa.sorted())


# 4
list_num = [9404,37464,7457,4645,44,54,879,63,84,50]

print(list_num.sorted())

# 5

list_numbers = [9404,37464,7457,4645,44,54,879,63,84,50]

print(list_numbers.sorted()[::-1])
