// 1)შექმენი ფუნცცია სახელად greet ,შიგნით შექმენი ცვლადი სახელად name და შეინახე რაიმე სახელი,შენი დავალებააა ფუნქციაში დააკონსოლლლოგო --> გამარჯობა ჩემი სახელია + name

// გამოიძახე ფუნქცია რომ ნახო შედეგი,ახსენი რატომ გამოიტანა ეს შედეგი კომენტარის სახით 

// შემდეგ ფუნქციის გარეთ დააკოლსოოლოგე name ცვლადი და ახსენი თუ რა მოხდა და რატომ მოხდა ასე

function greet() {
    let name = "Giorgi"
    console.log("გამარჯობა ჩემი სახელია " + name)
}

greet()
console.log(name)

// გამარჯობა ჩემი სახელია Giorgi
// ეს იმიტომ გამოიტანა რომ კონსოლ ლოგში გამოვიზახეთ გრეთი

