# 1) დაწერეთ ფუნქცია, რომელსაც არგუმენტად გადაეცემა რიცხვი და აბრუნებს ამ რიცხვის კვადრატს.
# 
# 2) დაწერეთ ფუნქცია, რომელსაც არგუმენტად გადაეცემა რიცხვი. იმ შმთხვევაში თ ეს რიცხვი ლუწია --> აბრუნებს "Odd", თუ კენტია --> "Even".
# 
# 3) კომენტარის სახით ახსენით როგორ მუშაობს .split() მეთოდი და მოიყვანეთ მისი გამოყენების 2 მაგალითი.
# 
# 4)  კომენტარის სახით ახსენით როგორ მუშაობს .join() მეთოდი და მოიყვანეთ მისი გამოყენების 2 მაგალითი.



# 1 

def num(number):
    mubs = int()
    if mubs == number:
        return mubs * number
    else:
        return "eror"
    




print(num(6))


# 2
def num(numb):
    if numb % 2 == 0:
        return "odd"
    else:
        return "Even"
print(num())

# 3

# spind მეთოდს შეუძლია რომ მაგალითად ჩვენ გვინდა გავაკეთოთ ძახილის მაგივრად ჩავსვათ სფეისი ეს უნდა გამოვიყენოთ ასე

def list(ls):
    lms = ['d!e!m!e!t!r!e']
    ls = lms.split(" ")