# 5) შექმენით დროში მოგზაურობის ფუნქცია რომელიც მომხმარებელს შეეკითხება მის ახლანდელ ასაკს და ამჟამინდელ წელს, ასევე რამდენი ხანით სურს დროშ მოგზაურობა შემდეგ კი ფუნქციამ უნდა დააბრუნოს დაბეჭდოს დროში მოგზაურობის შემდეგ რომელი წელი იქნება და რამდენი წლის იქნება მომხმარებელი, ასევე დაამატეთ რომ მომხმარებელმა მიიღოს გადაწყვეტილება წარსულში სურს დრში მოგზაურობა თუ მომავალში

def time():
    ამჟამინდელი_დრო = int(input("დაწერე რამდენი წელიწადია ეხლა: "))
    რამდენიწლის_ხართ =int( input("რამდენი წლის ხარ ეხლა: ") )

    სად_გსურთ_მოგზაურობა_წარსულში_თუ_მომავალში = input("დაწერე სად გსურთ მოგზაურობა წარსულში თუ მომავალში:")
    რამდენი_წლით_გსურთმოგზაურობა = int(input("დაწერეთ რამდენი წლით გსუ4რთ მოგზაურობა: "))
    
    ამჟამინდელი_დრო += რამდენი_წლით_გსურთმოგზაურობა
        
    რამდენი_წლით_გსურთმოგზაურობა += რამდენი_წლით_გსურთმოგზაურობა
         
    
    print(ამჟამინდელი_დრო)  
    print(რამდენიწლის_ხართ)
    print(სად_გსურთ_მოგზაურობა_წარსულში_თუ_მომავალში)

time()
