// 1) მომხმარებელს შემოატანინე ორი ნამბერ ტიპის მონაცემი(გადააქციეთ ორივე შემოყვანილი რიცხვად<-- არ დაგავიდყდეთ)

// შემდეგ შეადარეთ არის თუ არა პირველი რიცხვი მეტი მეორე რიცხვზე(არ გჭირდებათ if else )პირდაპირ კონსოლში შეამოწმეთ'

// 2) მომხმარებელს შემოატანინეთ ორი რიცხვი როგორც ზემოთ , შემდეგ შეამოწმეთ არის თუ არა პირველი რიცხვი ტოლი(მკაცრი) მეორე რიცხვზე

// 3)მომხმარებელს შემოატანინე ორი სტრინგი ,შეამოწმე არის თუ არა ორივე სტრინგი ერთმნაირი(მკაცრი)

let num1 = Number(prompt("enter number: "))
let num2 = Number(prompt("enter number: "))

console.log(num1 > num2)
// -----------------------------------------------------

console.log(num1 === num2)

// -----------------------------------------------------

let str1 = prompt("enter str: ")
let str2 = prompt("enter str: ")

console.log(str1 === str2)