// 1)შექმენით ცვლადი და შეინახეთ ათწილადი რიცხვი

// შენი დავალებაა გაიგო უარყოფითა დადებითი თუ 0 გადაცემული რიცხვი .sign()

// 2)აიყვანე რიცხვი 3 რიცხვი 5 ის ხარისხში

// 3)ამოიღე ფესვი 81 დან და დაბეჭდე შედეგი

// 4)გადააქციე  უარყოფითი რიცხვი დადებით რიცხვად

// 5)იპოვე რაიმე 5 რიცხვიდან იმცირესი

// 6)იპოვე რაიმე 5 რიცხვიდან უდიდესი

// 7)დააგენერირე რაიმე რენდომ რიცხვი


let num = 23.98765

console.log(Math.sign(num))

// -------------------------------------------------------------------------------

console.log(Math.pow(3, 5))

// --------------------------------------------------------

console.log(Math.sqrt(81))

// -------------------------------------------------------------------

console.log(Math.abs(-5567))
// ---------------------------------------------------------

console.log(Math.min(12, 7, 25, 3, 18))

// -------------------------------------------------

console.log(Math.max(12, 7, 25, 3, 18))


// ----------------------------------------------------------

console.log(Math.random())