# 1) შექმენით სია და დაამატეთ რამდენიმე სახელი. გამოიყენეთ sorted() ფუნქცია, რომ ამ სახელების პირველი ასოს მიხედვით დალაგდეს ეს სახელები (ანბანის მიხედვით)

# 2) პირველი დავალება გაიმეორეთ, ოღონდ მიღებული შედეგი Indexing-ის საშუალებით შეაბრუნეთ.
# 
# 3) შექმენით რიცხვების სია და დაამატეთ რიცხვები კლების მიხედვით, თქვენი მიზანი იქნება ეს რიცხვები ზრდადობის მიხედვით დაალაგოთ.
# 
# 4) შექმენით რიცხვების სია და დაამატეთ  მინიმუმ 10 რიცხვი ზრდადობის მიხედვით, თქვენი მიზანი იქნება ეს რიცხვები კლებადობის მიხედვით დაალაგოთ.

# 1

names_list = ["demetre", "vika", "mariami", "merabi"]

print(sorted(names_list))

# 2

name_list = ["demetre", "vika", "mariami", "merabi"]

print(sorted(name_list)[::-1])

# 3

numbers = [2, 223,4253, 536, 738, 920, 142, 2648 ,27 ,62 , 77]

print(sorted(numbers)[::-1])


# 4

numbb = [2 ,223, 64775, 7349, 8745, 7457, 9230, 8365 ,1]

print(sorted(numbb))